import css from "../style.module.scss";

export default function Contact() {
  const data = [
    {
      title: "جمع المعلومات الشخصية",
      description: [
        "تجمع الشركة المعلومات الشخصية من عملائها ومستخدمي موقعها الإلكتروني بأكثر من طريقة، بما في ذلك معلومات الاتصال: مثل الاسم وعنوان البريد الإلكتروني ورقم الهاتف، جمع معلومات الموقع الإلكتروني: مثل عنوان بروتوكولات الإنترنت IP ومعلومات ملف تعريف الارتباط  Cookies.",
      ],
      list: [],
    },
    {
      title: "استخدام المعلومات الشخصية",
      description: ["تستخدم شركة إرسال المعلومات الشخصية للأغراض التالية:"],
      list: [
        "تقديم خدمات التسويق الإلكتروني: مثل إنشاء حملات تسويقية وإرسال رسائل ترويجية على بريدك الإلكتروني، خدمة تصميم المواقع.",
        "تحسين تجربة المستخدم: مثل تحليل سلوكيات المستخدم وفهم احتياجات العملاء بشكل أفضل لتقديم أفضل تجربة على الموقع الإلكتروني.",
        "تحسين تجربة المستخدم: مثل تحليل سلوكيات المستخدم وفهم احتياجات العملاء بشكل أفضل لتقديم أفضل تجربة على الموقع الإلكتروني.",
        "التواصل مع العملاء: مثل الرد على الأسئلة وتقديم الدعم.",
        "الأغراض القانونية: مثل الامتثال للقوانين واللوائح المعمول بها.",
      ],
    },
    {
      title: "مشاركة المعلومات الشخصية",
      description: [
        "يمكن مشاركة المعلومات الشخصية مع جهات خارجية أخرى في الحالات التالية:",
      ],
      list: [
        "شركات مزودي الخدمة: مثل شركات استضافة المواقع وتطوير البرامج التسويقية.",
        "الشركاء التجاريون: مثل شركات الإعلان والتسويق.",
        "الجهات الحكومية: مثل الامتثال للقوانين واللوائح المعمول بها.",
      ],
    },
    {
      title: "سياسة التسجيل والتواصل",
      description: [],
      list: [
        "تهدف عملية تسجيل معلوماتك الشخصية إلى إتمام معاملاتك أو الاتصال بك. البيانات التي تقدمها خلال عملية التسجيل أو التواصل هي بيانات محمية وفقا للبنود الموضحة سابقا.",
        "يرجى العلم أنه عند استخدامك لموقعنا الإلكتروني، فأنت توافق على استقبال رسائلنا الإلكترونية بجميع أشكالها، من خلال البريد الالكتروني، النشرات الدورية، الإشعارات، التنبيهات، أو الرسائل النصية المعلن عنها في الموقع الإلكتروني.",
        "أنت توافق على أن جميع المعاملات الإلكترونية المرسلة لك من شركة إرسال، هي ملزمة قانونيا وتعامل مثل المعاملات الخطية.",
      ],
    },
    {
      title: "خيارات العملاء",
      description: [
        "يرجى العلم أنه في حال اعتراضك على نظام معالجتنا لمعلوماتك الشخصية عن طريق النقل أو الاستخدام بأي وسيلة، الرجاء إرسال طلبك إلىنا على البريد الإلكتروني: (info.ersalmarketingagency@gmail.com) أو بإمكانك تجنب استخدام خدمات الموقع الإلكتروني.",
        "نحن لا نتاجر بمعلوماتك الشخصية بأي وسيلة كانت من بيع أو تأجير لأي طرف ثالث بدون الحصول على موافقتك الصريحة في المقام الأول.",
      ],
      list: [],
    },
    {
      title: "التغييرات في سياسة الخصوصية",
      description: [
        "قد نعمل على تحديث سياسة الخصوصية من وقت لآخر، وسوف ننشر أي تغييرات هنا. ننصحك بمراجعة هذه الصفحة بانتظام لمعرفة آخر تحديثاتنا حول كيفية حماية معلوماتك.",
      ],
      list: [],
    },
  ];

  return (
    <div className="mil-up">
      {data.map((d, m) => (
        <Item {...d} key={m} />
      ))}
    </div>
  );
}

function Item({ title, description, list }) {
  return (
    <div className={css.item}>
      <h3>{title}.</h3>
      {description.map((a, b) => (
        <p key={b}>{a}</p>
      ))}
      <ul>
        {list.map((a, b) => (
          <li key={b}>{a}</li>
        ))}
      </ul>
    </div>
  );
}
