// css
import css from "./style.module.scss";

export default function Content() {
  const words = [
    "الابتكار",
    "التميز",
    "الالتزام",
    "الجودة",
    "التخطيط",
    "العمل الجماعي",
  ];

  return (
    <div className="container">
      <div className={css.content}>
        <section>
          <ul className={css.words}>
            {words.map((word) => (
              <li key={word}>{word}</li>
            ))}
          </ul>
        </section>

        <section>
          <h3>عن إرسال</h3>
          <p>
            إرسال شركة تسويق إلكتروني تقدم كل خدمات التسويق الرقمي. لديها فريق
            متخصص وخبرة كبيرة في التخطيط، وبناء الاستراتيجيات لزيادة الوعي
            بالعلامة التجارية من أجل تحقيق النجاح الأمثل للشركات.
          </p>
          <p>
            نعمل معك في إرسال على تكوين وتعزيز وتطوير الهوية الرقمية لعلامتك
            التجارية، من خلال حلول تسويقية مبتكرة، ومدعومة بأحدث التقنيات؛ التي
            تساعدك في تحقيق النمو السريع لشركتك.
          </p>
        </section>

        <section>
          <h3>هدفنا</h3>
          <p>
            نلتزم بتقديم حلول تسويقية مبتكرة لعملائنا، ونعمل من خلال خبرائنا على
            ترجمة أفكار الشركات إلى نتائج ملموسة؛ للوصول إلى عالم غير محدود من
            الفرص والإمكانيات.
          </p>
        </section>
        <section>
          <h3>رؤيتنا</h3>
          <p>
            نؤمن بأهمية التسويق الإبداعي، ونعمل على تطوير حلول تسويقية جديدة
            تلبي احتياجات الشركات في كل القطاعات، ونتعهد بتقديم خدمة عملاء
            احترافية تليق بمكانة عملائنا، لأن رؤية إرسال تبني علاقات طويلة
            الأمد، وتقدم قيمة مضافة لعملائها، باعتبارنا شركائهم في النجاح.
          </p>
        </section>
      </div>
    </div>
  );
}
