import css from "../style.module.scss";

export default function Contact() {
  const data = [
    {
      title: "أهداف هذه الشروط",
      description: [
        "تزويد العملاء بمعلومات شاملة: تهدف هذه الشروط إلى تعريف العملاء بجميع الخدمات التسويقية التي تقدمها الشركة وشروط استخدامها.",
        "لحصول على موافقة العملاء: قبل إبرام أي عقد أو اتفاق، تطلب الشركة من العملاء الموافقة على هذه الشروط والأحكام.",
        "حقوق الشركة: تتمتع شركة إرسال بحق قبول أو رفض تقديم أي خدمة من الخدمات المقدمة دون الرجوع إلى العميل أو إخطاره بذلك.",
      ],
      list: [],
    },
    {
      title: "الشروط والأحكام العامة",
      description: [],
      list: [
        {
          title: "الالتزام بالقانون",
          description:
            "تلتزم شركة إرسال باحترام قوانين الدولة، وبالتالي لا يُسمح بأي محتوى مخالف للآداب العامة أو يُخل بالقانون أو يُضر بالدولة.",
        },
        {
          title: "الالتزام بالرسوم",
          description:
            "يلتزم العميل بدفع جميع الرسوم المحددة في عقد الخدمة قبل تجديدها.",
        },
        {
          title: "مسؤولية الشركة",
          description:
            "تتحمل شركة إرسال مسؤولية الخدمات المقدمة من خلال موقعها الإلكتروني وأرقام هواتفها الرسمية فقط. ولن تتحمل أي مسؤولية عن أي اتفاق خارج هذه الوسائل.",
        },
        {
          title: "التأخير في الدفع",
          description:
            "في حال تأخر العميل عن دفع الرسوم في الوقت المحدد، سيتم إيقاف الخدمة حتى سداد جميع المستحقات.",
        },
        {
          title: "ضرائب القيمة المضافة",
          description:
            "يلتزم العميل بدفع ضرائب القيمة المضافة على الخدمات، ولا تتحمل شركة إرسال أي مسؤولية عن ذلك.",
        },
        {
          title: "احترام فريق العمل",
          description:
            "يلتزم العميل باحترام فريق عمل شركة إرسال، ولا يحق له الإساءة إليهم أو التقليل من شأن الشركة. في حال حدوث ذلك، سيتم اتخاذ الإجراءات القانونية اللازمة.",
        },
        {
          title: "الموافقة على الشروط",
          description:
            "يوافق العميل على جميع الشروط والأحكام والبنود الواردة فيه بعد توقيع عقد الخدمة.",
        },
        {
          title: "حقوق الملكية الفكرية",
          description:
            "تمتلك شركة إرسال جميع حقوق الملكية الفكرية المتعلقة بالتصاميم والمحتوى، ولا يُسمح للعميل بنسخها أو تعديلها دون موافقة كتابية من الشركة.",
        },
        {
          title: "التعديلات على البرمجة",
          description:
            "في حال إجراء أي تعديلات على البرمجة دون الرجوع إلى شركة إرسال، فإن الشركة غير ملزمة بإعادة التصميم إلا مقابل رسوم إضافية.",
        },
      ],
    },
  ];

  return (
    <>
      <div className="mil-up">
        {data.map((d, m) => (
          <Item {...d} key={m} />
        ))}
      </div>
      <fieldset className={css.fieldset}>
        <legend>ملاحظة:</legend>
        <p>
          هذه الشروط والأحكام قابلة للتغيير في أي وقت دون إشعار مسبق. يُنصح
          بمراجعة موقع شركة إرسال الإلكتروني للاطلاع على آخر التحديثات.
        </p>
      </fieldset>
    </>
  );
}

function Item({ title, description, list }) {
  return (
    <div className={css.item}>
      <h3>{title}.</h3>
      {description.map((a, b) => (
        <p key={b}>{a}</p>
      ))}
      <ol>
        {list.map((a, b) => (
          <li key={b}>
            <h5>{a.title}:</h5>
            <div>{a.description}</div>
          </li>
        ))}
      </ol>
    </div>
  );
}
