import css from "../style.module.scss";

export default function Intro() {
  return (
    <div className={css.Intro}>
      <p>
        نحن في شركة إرسال نقدر خصوصية عملائنا ونلتزم بحماية بياناتهم الشخصية،
        ونأخذ هذا الأمر بجدية تامة ونعتقد أن المعلومات الشحصية للعملاء هي واحدة
        من أهم الموارد لدينا.
      </p>
      <p>
        توضح سياسة الخصوصية كيف تجمع الشركة وتستخدم وتكشف المعلومات الشخصية،
        التي تجمعها من عملائها ومستخدمي موقعها الإلكتروني.
      </p>
    </div>
  );
}
